Repository: linhay/nolon
Catalog: nolon/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld downloads
zh_hans: %lld 次下载

source: %lld Downloads
zh_hans: %lld 次下载

source: %lld Installs
zh_hans: %lld 次安装

# %lld skill%@
source: %1$lld skill%2$@
zh_hans: %lld 个技能%@

source: %lld stars
zh_hans: %lld 个 Star

source: %lld Stars
zh_hans: %lld 个星标

source: %lld Usages
zh_hans: %lld 次使用

source: About
zh_hans: 关于

source: About this skill
zh_hans: 关于此 Skill

# accounts.action.open_provider
source: Open Provider
zh_hans: 打开 Provider

# accounts.empty.description
source: Manage supported provider accounts from one place.
zh_hans: 在一个页面集中管理支持账号能力的 Provider。

# accounts.empty.title
source: No account providers
zh_hans: 暂无可管理账号的 Provider

# accounts.filter.hide_error_off
source: Hide Errored Accounts
zh_hans: 隐藏报错账号

# accounts.provider.pi.auth_invalid
source: ~/.pi/agent/auth.json is unreadable or invalid
zh_hans: ~/.pi/agent/auth.json 无法读取或格式无效

# accounts.provider.pi.auth_missing
source: ~/.pi/agent/auth.json not found
zh_hans: 未找到 ~/.pi/agent/auth.json

# accounts.provider.readonly
source: Read-only summary
zh_hans: 只读摘要

# accounts.provider.unsupported
source: No aggregated usage data
zh_hans: 暂无聚合用量数据

# accounts.summary.none
source: No account
zh_hans: 暂无账号

# accounts.summary.readonly
source: Read-only
zh_hans: 只读

# accounts.usage.primary_used
source: Primary used %.0f%%
zh_hans: 主窗口已用 %.0f%%

# accounts.usage.updated_at
source: Updated %@
zh_hans: 更新于 %@

# action.add_provider
source: Add Provider
zh_hans: 添加 Provider

# action.cancel
source: Cancel
zh_hans: 取消

# action.delete
source: Delete
zh_hans: 删除

# action.delete_confirm_message_mcp
source: Are you sure you want to delete this MCP server? This will remove its configuration.
zh_hans: 你确定要删除此 MCP 服务器吗？这将移除其配置。

# action.delete_confirm_title
source: Confirm Delete
zh_hans: 确定删除

# action.delete_confirm_title_mcp
source: Confirm Delete MCP
zh_hans: 确定删除 MCP

# action.edit
source: Edit
zh_hans: 编辑

# action.import
source: Import
zh_hans: 导入

# action.import_all
source: Import All
zh_hans: 全部导入

# action.migrate
source: Migrate
zh_hans: 迁移

# action.ok
source: OK
zh_hans: 确定

# action.save
source: Save
zh_hans: 保存

# action.show_in_finder
source: Show in Finder
zh_hans: 在 Finder 中显示

# action.uninstall_confirm_message
source: Are you sure you want to uninstall this skill? This action cannot be undone.
zh_hans: 你确定要卸载此技能吗？此操作无法撤销。

# action.uninstall_confirm_title
source: Confirm Uninstall
zh_hans: 确定卸载

# action.unlink_workflow
source: Unlink Workflow
zh_hans: 取消关联工作流

# action.update
source: Update
zh_hans: 更新

# action.view_official_docs
source: View Official Documentation
zh_hans: 查看官方文档

source: Add
zh_hans: 添加

source: Add one or more paths containing skills (e.g., 'skills', 'python', '.agent/skills'). Use '.' for repository root.
zh_hans: 添加一个或多个包含技能的路径（例如 'skills'、'python'、'.agent/skills'）。使用 '.' 表示仓库根目录。

source: Add Provider
zh_hans: 添加 Provider

source: Add Repository
zh_hans: 添加仓库

# add_provider.error.exists
source: This provider configuration already exists.
zh_hans: Provider 已存在

# add_provider.error.name_exists
source: A provider with this name already exists.
zh_hans: 该名称的 Provider 已存在

# add_provider.error.path_exists
source: A provider with this path already exists.
zh_hans: 该路径的 Provider 已存在

# add_provider.kind_label
source: Type
zh_hans: 类型

# add_provider.kind.project
source: Project
zh_hans: 项目

# add_provider.kind.vendor
source: Vendor
zh_hans: 厂商

# add_provider.kind.vendor_info_label
source: Paths
zh_hans: 路径

# add_provider.kind.vendor_paths_locked
source: Vendor paths are predefined and cannot be changed.
zh_hans: 厂商路径为预设，无法修改。

# add_provider.no_project_folder
source: No project folder selected
zh_hans: 未选择项目文件夹

# add_provider.project_folder_label
source: Project Folder
zh_hans: 项目文件夹

# add_provider.resolved_paths_label
source: Resolved Paths
zh_hans: 解析后的路径

source: Adding repository...
zh_hans: 正在添加仓库...

# agents.create.base
source: Create AGENTS.md
zh_hans: 创建 AGENTS.md

# agents.create.override
source: Create AGENTS.override.md
zh_hans: 创建 AGENTS.override.md

# agents.empty
source: No AGENTS.md Files
zh_hans: 没有 AGENTS.md 文件

# agents.empty_desc
source: No AGENTS.md files found in Codex home
zh_hans: 在 Codex Home 中未找到 AGENTS.md 文件

# agents.priority.base
source: Base priority
zh_hans: 基础优先级

# agents.priority.override
source: Higher priority (override)
zh_hans: 更高优先级（override）

# appearance.dark
source: Dark
zh_hans: 深色

# appearance.light
source: Light
zh_hans: 浅色

# appearance.system
source: System
zh_hans: 系统

source: Arguments
zh_hans: 参数

source: Associate this skill with a workflow in **%@**.
zh_hans: 将此技能与 **%@** 中的工作流关联。

source: Browse and install skills from Clawdhub
zh_hans: 浏览并安装来自 Clawdhub 的 Skills

source: Built-in
zh_hans: 内置

source: Cancel
zh_hans: 取消

source: Changelog
zh_hans: 更新日志

source: Check for Updates…
zh_hans: 检查更新…

source: Choose Skills Directories
zh_hans: 选择技能目录

source: Choose...
zh_hans: 选择...

source: Clawdhub is the official skill marketplace.
zh_hans: Clawdhub 是官方 Skill 市场。

source: Close
zh_hans: 关闭

# codex.accounts.action.activate
source: Activate
zh_hans: 切换

# codex.accounts.action.add
source: Add Account
zh_hans: 添加账号

# codex.accounts.add.cli.desc
source: Nolon will run `codex login` and automatically import the new auth.json when it is created.
zh_hans: Nolon 会运行 `codex login`，并在生成新的 auth.json 后自动导入。

# codex.accounts.add.cli.error.no_auth
source: Login did not create auth.json.
zh_hans: 登录未生成 auth.json。

# codex.accounts.add.cli.running
source: Logging in…
zh_hans: 正在登录…

# codex.accounts.add.cli.start
source: Start CLI Login
zh_hans: 开始 CLI 登录

# codex.accounts.add.cli.waiting
source: Waiting for auth.json…
zh_hans: 等待生成 auth.json…

# codex.accounts.add.error.no_codex_home
source: Codex home path is unavailable.
zh_hans: Codex Home 路径不可用。

# codex.accounts.add.error.no_file
source: Select an auth.json file first.
zh_hans: 请先选择 auth.json 文件。

# codex.accounts.add.name
source: Account name
zh_hans: 账号名称

# codex.accounts.add.no_codex_home
source: Codex home path could not be resolved from this provider.
zh_hans: 无法从此 Provider 推断 Codex Home 路径。

# codex.accounts.add.no_file
source: No file selected
zh_hans: 未选择文件

# codex.accounts.add.source
source: Source
zh_hans: 来源

# codex.accounts.add.source.cli
source: CLI Login
zh_hans: CLI 登录

# codex.accounts.add.source.current
source: Current auth.json
zh_hans: 当前 auth.json

# codex.accounts.add.source.file
source: Import auth.json file
zh_hans: 导入 auth.json 文件

# codex.accounts.add.title
source: Add Account
zh_hans: 添加账号

# codex.accounts.badge.active
source: Active
zh_hans: 当前

# codex.accounts.config.basic
source: Basic
zh_hans: 基础信息

# codex.accounts.config.edit
source: Edit Config
zh_hans: 编辑配置

# codex.accounts.config.error.api_key_required
source: API Key is required.
zh_hans: API Key 为必填项。

# codex.accounts.config.error.name_required
source: Name is required.
zh_hans: 名称为必填项。

# codex.accounts.config.new_api_key
source: New API Key
zh_hans: 新增 API Key

# codex.accounts.config.new_relay
source: New Relay
zh_hans: 新增 Relay

# codex.accounts.copy_error
source: Copy error
zh_hans: 复制错误

# codex.accounts.current.api_key
source: Current: API key ••••%@.
zh_hans: 当前：API Key ••••%@。

# codex.accounts.current.email
source: Current: %@.
zh_hans: 当前：%@。

# codex.accounts.current.none
source: Current: No auth.json found.
zh_hans: 当前：未找到 auth.json。

# codex.accounts.current.plan
source: Plan: %@.
zh_hans: 套餐：%@。

# codex.accounts.delete.title
source: Delete Account
zh_hans: 删除账号

# codex.accounts.empty.desc
source: Add a snapshot of Codex auth.json to quickly switch accounts.
zh_hans: 添加 Codex auth.json 快照以快速切换账号。

# codex.accounts.empty.title
source: No accounts
zh_hans: 暂无账号

# codex.accounts.error.activate
source: Failed to activate this account.
zh_hans: 切换账号失败。

# codex.accounts.error.add
source: Failed to add this account.
zh_hans: 添加账号失败。

# codex.accounts.error.auth_expired
source: Authentication expired. Please sign in again.
zh_hans: 认证已失效，请重新登录。

# codex.accounts.error.delete
source: Failed to delete this account.
zh_hans: 删除账号失败。

# codex.accounts.filter.hide_error_off
source: Hide Errored Accounts
zh_hans: 隐藏报错账号

# codex.accounts.filter.hide_error_on
source: Show Errored Accounts
zh_hans: 显示报错账号

# codex.accounts.filter.hide_error.help
source: Toggle whether errored accounts are hidden
zh_hans: 切换是否隐藏报错账号

# codex.accounts.filter.hide_zero_off
source: Hide Zero-Quota Accounts
zh_hans: 隐藏无额度账号

# codex.accounts.filter.hide_zero_on
source: Show All Accounts
zh_hans: 显示全部账号

# codex.accounts.filtered_empty.desc
source: Accounts with a 0% longest quota window are currently hidden. Turn off the filter to see all accounts.
zh_hans: 当前已隐藏最长额度窗口为 0% 的账号。关闭筛选后可查看全部账号。

# codex.accounts.filtered_empty.desc.hide_error
source: Errored accounts are currently hidden. Turn off the filter to see all accounts.
zh_hans: 当前已隐藏报错账号。关闭筛选后可查看全部账号。

# codex.accounts.filtered_empty.desc.hide_zero_and_error
source: Accounts with 0% longest quota window or errors are hidden. Turn off filters to see all accounts.
zh_hans: 当前已隐藏无额度或报错账号。关闭筛选后可查看全部账号。

# codex.accounts.filtered_empty.title
source: No Visible Accounts
zh_hans: 没有可显示的账号

# codex.accounts.login_at
source: Last login
zh_hans: 登录时间

# codex.accounts.menu.copy_account_id
source: Copy Account ID
zh_hans: 复制账号 ID

# codex.accounts.menu.copy_auth_path
source: Copy Auth Path
zh_hans: 复制 Auth 路径

# codex.accounts.multi.enable
source: Multi-account
zh_hans: 多账号

# codex.accounts.relogin
source: Re-login
zh_hans: 重新登录

# codex.accounts.status.failed
source: Failed
zh_hans: 状态异常

# codex.accounts.status.reauth_needed
source: Needs re-login
zh_hans: 需要重新登录

# codex.accounts.sync.failure
source: Last failure
zh_hans: 最近失败

# codex.accounts.sync.success
source: Last sync
zh_hans: 上次同步

# codex.accounts.time.login.inline
source: Login %@
zh_hans: 登录 %@

# codex.accounts.time.sync.absolute
source: Synced %@
zh_hans: 同步于 %@

# codex.accounts.time.sync.inline
source: Synced %@ ago
zh_hans: 同步于 %@ 前

# codex.accounts.time.sync.just_now
source: Synced just now
zh_hans: 刚刚同步

# codex.accounts.title
source: Accounts
zh_hans: 账号

# codex.advanced.config.multi_agent.add_builtin.format
source: Add or Override: %@
zh_hans: 新增或覆盖：%@

# codex.advanced.config.multi_agent.add_role
source: Add Role
zh_hans: 添加角色

# codex.advanced.config.multi_agent.add_role.empty
source: Add Empty Role
zh_hans: 新增空白角色

# codex.advanced.config.multi_agent.config_file
source: config file path
zh_hans: 配置文件路径

# codex.advanced.config.multi_agent.description
source: description
zh_hans: 描述

# codex.advanced.config.multi_agent.empty
source: No roles configured yet. Click Add Role to create the first role.
zh_hans: 尚未配置角色。点击“添加角色”创建第一个角色。

# codex.advanced.config.multi_agent.model
source: model
zh_hans: 模型

# codex.advanced.config.multi_agent.role_name
source: role name
zh_hans: 角色名

# codex.advanced.config.multi_agent.status_disabled
source: Multi-agent is disabled. Enable the switch above to edit roles.
zh_hans: 多代理已关闭。请先打开上方开关，再编辑角色。

# codex.advanced.config.multi_agent.status_enabled
source: Multi-agent is enabled. You can edit roles and agents settings below.
zh_hans: 多代理已启用。你可以在下方编辑角色和代理参数。

# codex.advanced.config.multi_agent.unnamed_role
source: Unnamed Role
zh_hans: 未命名角色

# codex.advanced.link.confirm
source: Confirm
zh_hans: 确定

# codex.advanced.link.conflict.message
source: The target folder already contains files. Confirm to delete its visible contents and replace it with a symlink.
zh_hans: 目标目录已包含文件。确认后将删除其中可见内容，并替换为软链接。

# codex.advanced.link.conflict.short
source: Contains visible files
zh_hans: 包含可见文件

# codex.advanced.link.conflict.title
source: Directory Contains Files
zh_hans: 目录包含文件

# codex.advanced.models_cache.activate
source: Activate
zh_hans: 激活

# codex.advanced.models_cache.activated
source: Activated
zh_hans: 已激活

# codex.advanced.models_cache.active
source: Active
zh_hans: 当前激活

# codex.advanced.models_cache.column.display_name
source: Display Name
zh_hans: 显示名

# codex.advanced.models_cache.column.model
source: Model
zh_hans: 模型

# codex.advanced.models_cache.column.visibility
source: Visibility
zh_hans: 可见性

# codex.advanced.models_cache.detail
source: Model Details
zh_hans: 模型详情

# codex.advanced.models_cache.field.context_window
source: Context Window
zh_hans: 上下文窗口

# codex.advanced.models_cache.field.default_reasoning_level
source: Default Reasoning
zh_hans: 默认推理等级

# codex.advanced.models_cache.field.display_name
source: Display Name
zh_hans: 显示名

# codex.advanced.models_cache.field.input_modalities
source: Input Modalities
zh_hans: 输入模态

# codex.advanced.models_cache.field.minimal_client_version
source: Minimum Client Version
zh_hans: 最低客户端版本

# codex.advanced.models_cache.field.slug
source: Model ID
zh_hans: 模型 ID

# codex.advanced.models_cache.field.supported_reasoning_levels
source: Reasoning Levels
zh_hans: 支持的推理等级

# codex.advanced.models_cache.field.supports_parallel_tool_calls
source: Parallel Tool Calls
zh_hans: 并行工具调用

# codex.advanced.models_cache.field.supports_reasoning_summaries
source: Reasoning Summaries
zh_hans: 推理摘要

# codex.advanced.models_cache.field.supports_verbosity
source: Verbosity Control
zh_hans: 输出详略控制

# codex.advanced.models_cache.field.upgrade
source: Upgrade Target
zh_hans: 升级目标

# codex.advanced.models_cache.field.visibility
source: Visibility
zh_hans: 可见性

# codex.advanced.models_cache.group.basic
source: Basic
zh_hans: 基础信息

# codex.advanced.models_cache.group.capabilities
source: Capabilities
zh_hans: 能力

# codex.advanced.models_cache.group.compatibility
source: Compatibility
zh_hans: 兼容性

# codex.advanced.models_cache.hidden
source: Hidden
zh_hans: 隐藏

# codex.advanced.models_cache.hidden_active_hint
source: Current model is hidden from list. Activate a visible model to replace it.
zh_hans: 当前模型在列表中不可见。激活一个可见模型即可替换。

# codex.advanced.models_cache.reasoning_effort
source: Reasoning Effort
zh_hans: 推理强度

# codex.advanced.models_cache.reasoning_effort.default
source: Use Model Default
zh_hans: 使用模型默认值

# codex.advanced.models_cache.reasoning_effort.unsupported
source: The active model does not support configurable reasoning effort.
zh_hans: 当前激活模型不支持配置推理强度。

# codex.advanced.models_cache.title
source: Models Cache
zh_hans: 模型缓存

# codex.advanced.models_cache.total
source: Total
zh_hans: 总数

# codex.advanced.models_cache.visibility.hide
source: Hidden
zh_hans: 隐藏

# codex.advanced.models_cache.visibility.list
source: Visible
zh_hans: 可见

# codex.advanced.models_cache.visible
source: Visible
zh_hans: 可见

# codex.advanced.xcode_links.desc
source: Link Xcode Codex folders to ~/.codex equivalents.
zh_hans: 将 Xcode Codex 目录链接到 ~/.codex 对应目录。

# codex.advanced.xcode_links.title
source: Xcode Folder Links
zh_hans: Xcode 目录链接

# codex.binary.activate
source: Activate
zh_hans: 激活

# codex.binary.active
source: Active
zh_hans: 已激活

# codex.binary.check_updates
source: Check Updates
zh_hans: 检查更新

# codex.binary.download_latest
source: Download Latest
zh_hans: 下载最新版本

# codex.binary.env.key_placeholder
source: KEY
zh_hans: 变量名

# codex.binary.env.title
source: Environment Variables
zh_hans: 环境变量

# codex.binary.env.value_placeholder
source: VALUE
zh_hans: 变量值

# codex.binary.error.title
source: Binary Error
zh_hans: 二进制错误

# codex.binary.import_local
source: Import Local Binary
zh_hans: 导入本地二进制

# codex.binary.model_placeholder
source: preferred model (e.g. gpt-5.3-codex)
zh_hans: 首选模型（例如 gpt-5.3-codex）

# codex.binary.not_supported.desc
source: Binary management is only available for Codex providers.
zh_hans: 二进制管理仅适用于 Codex Provider。

# codex.binary.not_supported.title
source: Not Supported
zh_hans: 不支持

# codex.binary.preferred_terminal
source: Preferred Terminal
zh_hans: 首选终端

# codex.binary.preferred_terminal.auto
source: Auto
zh_hans: 自动

# codex.binary.sync_model
source: Sync model on switch
zh_hans: 切换版本时同步模型

# codex.binary.update.available
source: Update available: %@
zh_hans: 有可用更新：%@

# codex.binary.update.available_generic
source: Update available
zh_hans: 有可用更新

# codex.binary.update.checking
source: Checking updates...
zh_hans: 正在检查更新...

# codex.binary.update.failed
source: Update check failed
zh_hans: 更新检查失败

# codex.binary.update.idle
source: Not checked yet
zh_hans: 尚未检查

# codex.binary.update.up_to_date
source: Up to date
zh_hans: 已是最新版本

# codex.cli_login.cancel
source: Cancel Login
zh_hans: 取消登录

# codex.config.description.approval_policy
source: Controls when Codex asks for permission before running sensitive commands.
zh_hans: 控制 Codex 在执行敏感命令前何时请求授权。

# codex.config.description.model_verbosity
source: Sets response detail level. Low is concise, high is more detailed.
zh_hans: 设置回答详细程度。低更简洁，高更详细。

# codex.config.option.approval_policy.never
source: Never
zh_hans: 从不

# codex.config.option.approval_policy.on-failure
source: On Failure
zh_hans: 失败时

# codex.config.option.approval_policy.on-request
source: On Request
zh_hans: 按需

# codex.config.option.approval_policy.untrusted
source: Untrusted
zh_hans: 不受信任

# codex.config.option.custom
source: Custom
zh_hans: 自定义

# codex.config.option.custom_value
source: Custom value
zh_hans: 自定义值

# codex.config.option.model_reasoning_effort.high
source: High
zh_hans: 高

# codex.config.option.model_reasoning_effort.low
source: Low
zh_hans: 低

# codex.config.option.model_reasoning_effort.medium
source: Medium
zh_hans: 中

# codex.config.option.model_reasoning_effort.minimal
source: Minimal
zh_hans: 最小

# codex.config.option.model_reasoning_summary.auto
source: Auto
zh_hans: 自动

# codex.config.option.model_reasoning_summary.concise
source: Concise
zh_hans: 简洁

# codex.config.option.model_reasoning_summary.detailed
source: Detailed
zh_hans: 详细

# codex.config.option.model_reasoning_summary.none
source: None
zh_hans: 无

# codex.config.option.model_verbosity.high
source: High
zh_hans: 高

# codex.config.option.model_verbosity.low
source: Low
zh_hans: 低

# codex.config.option.model_verbosity.medium
source: Medium
zh_hans: 中

# codex.config.option.personality.balanced
source: Balanced
zh_hans: 平衡

# codex.config.option.personality.concise
source: Concise
zh_hans: 简洁

# codex.config.option.personality.verbose
source: Verbose
zh_hans: 详细

# codex.config.option.sandbox_mode.danger-full-access
source: Danger Full Access
zh_hans: 完全访问（危险）

# codex.config.option.sandbox_mode.read-only
source: Read Only
zh_hans: 只读

# codex.config.option.sandbox_mode.workspace-write
source: Workspace Write
zh_hans: 工作区可写

# codex.config.option.unset
source: Unset
zh_hans: 未设置

# codex.config.option.web_search.cached
source: Cached
zh_hans: 缓存

# codex.config.option.web_search.disabled
source: Disabled
zh_hans: 禁用

# codex.config.option.web_search.live
source: Live
zh_hans: 实时

# codex.features.description.apply_patch_freeform
source: Enable freeform apply_patch tool mode.
zh_hans: 启用 freeform apply_patch 工具模式。

# codex.features.description.apps
source: Enable ChatGPT Apps/connectors support.
zh_hans: 启用 ChatGPT Apps/Connectors 支持。

# codex.features.description.apps_mcp_gateway
source: Use the Apps MCP gateway endpoint.
zh_hans: 使用 Apps MCP gateway 端点。

# codex.features.description.child_agents_md
source: Append additional AGENTS.md guidance.
zh_hans: 附加额外的 AGENTS.md 指引。

# codex.features.description.collab
source: Enable collab/sub-agent tools.
zh_hans: 启用协作/子代理工具。

# codex.features.description.collaboration_modes
source: Enable collaboration modes such as plan mode.
zh_hans: 启用 plan mode 等协作模式。

# codex.features.description.elevated_windows_sandbox
source: Enable elevated Windows sandbox runner.
zh_hans: 启用提升权限的 Windows 沙箱运行器。

# codex.features.description.enable_request_compression
source: Enable compressed request bodies.
zh_hans: 启用压缩请求体。

# codex.features.description.exec_policy
source: Enable exec policy pipeline.
zh_hans: 启用 exec policy 流程。

# codex.features.description.experimental_windows_sandbox
source: Enable Windows restricted-token sandbox.
zh_hans: 启用 Windows restricted-token 沙箱。

# codex.features.description.memory_tool
source: Enable startup memory extraction and consolidation.
zh_hans: 启用启动时内存提取与合并。

# codex.features.description.multi_agent
source: Enable multi-agent collaboration tools.
zh_hans: 启用多代理协作工具。

# codex.features.description.personality
source: Enable personality selection controls.
zh_hans: 启用 personality 选择控制。

# codex.features.description.powershell_utf8
source: Enforce UTF8 output in PowerShell.
zh_hans: 在 PowerShell 中强制 UTF-8 输出。

# codex.features.description.remote_compaction
source: Enable remote compaction flow.
zh_hans: 启用远程压缩流程。

# codex.features.description.remote_models
source: Refresh remote model list before readiness.
zh_hans: 在就绪前刷新远程模型列表。

# codex.features.description.request_rule
source: Enable smart approval prefix rule suggestions.
zh_hans: 启用智能审批前缀规则建议。

# codex.features.description.responses_websockets
source: Use Responses API WebSocket transport by default.
zh_hans: 默认使用 Responses API WebSocket 传输。

# codex.features.description.responses_websockets_v2
source: Enable Responses API websocket v2 mode.
zh_hans: 启用 Responses API websocket v2 模式。

# codex.features.description.runtime_metrics
source: Show runtime metrics summaries in TUI.
zh_hans: 在 TUI 中显示运行时指标摘要。

# codex.features.description.search_tool
source: Enable search_tool_bm25 tool discovery.
zh_hans: 启用 search_tool_bm25 工具发现。

# codex.features.description.shell_snapshot
source: Snapshot shell env for repeated commands.
zh_hans: 为重复命令快照 shell 环境。

# codex.features.description.shell_tool
source: Enable the default shell tool.
zh_hans: 启用默认 shell 工具。

# codex.features.description.skill_env_var_dependency_prompt
source: Prompt for missing skill env var dependencies.
zh_hans: 提示缺失的技能环境变量依赖。

# codex.features.description.skill_mcp_dependency_install
source: Allow installing missing MCP dependencies for skills.
zh_hans: 允许为技能安装缺失的 MCP 依赖。

# codex.features.description.sqlite
source: Persist rollout metadata to local SQLite.
zh_hans: 将 rollout 元数据持久化到本地 SQLite。

# codex.features.description.steer
source: Enable steer mode behavior.
zh_hans: 启用 steer 模式行为。

# codex.features.description.undo
source: Create a ghost commit at each turn.
zh_hans: 在每一轮创建一个幽灵提交。

# codex.features.description.unified_exec
source: Use the unified PTY-backed exec tool.
zh_hans: 使用基于 PTY 的统一 exec 工具。

# codex.features.description.unrecognized
source: Detected from config.toml but not in current built-in feature registry.
zh_hans: 从 config.toml 检测到，但不在当前内置 feature 注册表中。

# codex.features.description.use_linux_sandbox_bwrap
source: Use Linux bubblewrap sandbox pipeline.
zh_hans: 使用 Linux bubblewrap 沙箱流程。

# codex.features.description.web_search
source: Legacy web_search feature toggle.
zh_hans: 旧版 web_search 功能开关。

# codex.features.description.web_search_cached
source: Legacy cached web search toggle.
zh_hans: 旧版缓存 web search 开关。

# codex.features.description.web_search_request
source: Legacy live web search toggle.
zh_hans: 旧版实时 web search 开关。

# codex.features.maturity.deprecated
source: Deprecated
zh_hans: 已弃用

# codex.features.maturity.experimental
source: Experimental
zh_hans: 实验性

# codex.features.maturity.removed
source: Removed
zh_hans: 已移除

# codex.features.maturity.stable
source: Stable
zh_hans: 稳定

# codex.features.maturity.under_development
source: Under Development
zh_hans: 开发中

# codex.features.maturity.unknown
source: Unknown
zh_hans: 未知

# codex.features.search.placeholder
source: Search features...
zh_hans: 搜索 Feature...

# codex.features.source.config_unrecognized
source: config.toml (unrecognized key)
zh_hans: config.toml（未识别键）

# codex.features.source.tag.cli_features_list
source: CLI Features List
zh_hans: CLI 特性列表

# codex.features.source.tag.codex_docs
source: Codex Docs
zh_hans: Codex 文档

# codex.features.source.tag.config_unknown
source: Config Unknown Key
zh_hans: 配置未知键

# codex.features.source.tag.core_features
source: Core Features
zh_hans: Core 特性
